{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "DetrForObjectDetection",
    "parent_library": "transformers.models.detr.modeling_detr"
  },
  "base_model_name_or_path": "facebook/detr-resnet-50",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "encoder.layers.0.self_attn.q_proj",
    "encoder.layers.1.self_attn.q_proj",
    "encoder.layers.3.self_attn.q_proj",
    "self_attn.v_proj",
    "encoder.layers.5.self_attn.q_proj",
    "self_attn.k_proj",
    "encoder.layers.4.self_attn.q_proj",
    "encoder.layers.2.self_attn.q_proj"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}